; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	infrared0 - mode
	thermograph2 - mode
	image3 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	Star5 - direction
	Star4 - direction
	GroundStation2 - direction
	Star6 - direction
	GroundStation8 - direction
	Star0 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument3 image3)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation7)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
	(supports instrument5 thermograph2)
	(supports instrument5 infrared0)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared0)
	(supports instrument6 image3)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 Star6)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite1 Planet14)
	(pointing satellite2 Star4)
	(have_image Star9 image3)
	(have_image Phenomenon10 thermograph1)
	(have_image Star11 infrared0)
	(have_image Planet12 thermograph1)
	(have_image Star13 thermograph1)
	(have_image Planet14 thermograph1)
	(have_image Phenomenon15 thermograph1)
	(have_image Star16 thermograph2)
))

)

; plan
1. (turn_to satellite3 groundstation2 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite3 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite3 star16 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star16)
   goals met: 0 of 10
5. (take_image satellite3 star16 instrument5 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 1 of 10
6. (turn_to satellite3 star11 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 star11)
   goals met: 1 of 10
7. (turn_to satellite1 planet14 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet14)
   goals met: 2 of 10
8. (turn_to satellite0 star6 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star6)
   goals met: 2 of 10
9. (take_image satellite3 star11 instrument5 infrared0)
   added: (have_image star11 infrared0)
   goals met: 3 of 10
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
11. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 3 of 10
12. (turn_to satellite0 phenomenon10 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 10
13. (take_image satellite0 phenomenon10 instrument0 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 4 of 10
14. (turn_to satellite0 phenomenon15 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon15)
   goals met: 4 of 10
15. (take_image satellite0 phenomenon15 instrument0 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 5 of 10
16. (turn_to satellite0 planet12 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet12)
   goals met: 5 of 10
17. (take_image satellite0 planet12 instrument0 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 6 of 10
18. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 6 of 10
19. (take_image satellite0 planet14 instrument0 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 7 of 10
20. (turn_to satellite0 star13 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star13)
   goals met: 7 of 10
21. (take_image satellite0 star13 instrument0 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 8 of 10
22. (turn_to satellite2 star4 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star4)
   goals met: 9 of 10
23. (turn_to satellite3 star9 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star9)
   goals met: 9 of 10
24. (take_image satellite3 star9 instrument5 image3)
   added: (have_image star9 image3)
   goals met: 10 of 10
